[
    {
        "id": 1,
        "name": "Introducción a Python",
        "capacity": 50,
        "teachers": [51,52,53],
        "students": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        "classes": [
            {
                "name": "Clase 1: Introducción a Python",
                "description": "En esta clase se presentará el lenguaje de programación Python, sus características y beneficios. También se mostrará cómo instalar Python y configurar el entorno de trabajo."
            },
            {
                "name": "Clase 2: Variables y tipos de datos",
                "description": "En esta clase se enseñará cómo crear y manipular variables en Python, y se presentarán los diferentes tipos de datos básicos como números, cadenas de texto y booleanos."
            },
            {
                "name": "Clase 6: Estructuras de control de flujo",
                "description": " En esta clase se explicará cómo controlar el flujo de ejecución de un programa en Python utilizando estructuras como if-else, while, for y try-except."
            },
            {
                "name": "Clase 4: Funciones",
                "description": "En esta clase se presentarán las funciones en Python, cómo crearlas, llamarlas y pasar argumentos a ellas. También se discutirá sobre la importancia de las funciones y cómo se utilizan en la programación."
            },
            {
                "name": "Clase 5: Listas y diccionarios",
                "description": "En esta clase se mostrará cómo utilizar listas y diccionarios en Python para almacenar y manipular datos. También se discutirán las operaciones básicas en estas estructuras de datos y se darán ejemplos de su uso en programas simples."
            },
            {
                "name": "Clase 6: Archivos y excepciones",
                "description": "En esta clase se enseñará cómo trabajar con archivos en Python, cómo leer y escribir en ellos, y cómo cerrarlos adecuadamente. También se explicará cómo manejar excepciones en Python, incluyendo cómo lanzar excepciones, cómo manejarlas y cómo crear excepciones personalizadas."
            }
        ],
        "price": 34326,
        "startDate": "2023-05-01",
        "endDate": "2023-06-01"
    },
    {
        "id": 2,
        "name": "HTML y CSS",
        "capacity": 30,
        "teachers": [54,55,56],
        "students": [11,12,13,14,15,16,17,18,19,20, 1],
        "classes": [
            {
                "name": "Clase 1: Introducción a HTML",
                "description": "En esta clase se presentará HTML y su estructura básica, incluyendo las etiquetas, los elementos y los atributos. También se mostrará cómo crear una página HTML básica y cómo visualizarla en un navegador web."
            },
            {
                "name": "Clase 2: Introducción a CSS",
                "description": "En esta clase se presentará CSS y cómo se utiliza para dar estilo y diseño a las páginas web. Se discutirán los diferentes tipos de selectores, la cascada y la herencia, y se mostrará cómo aplicar estilos básicos a una página HTML."
            },
            {
                "name": "Clase 3: Diseño de páginas web con CSS",
                "description": "En esta clase se explicará cómo diseñar páginas web más complejas utilizando CSS, incluyendo el diseño de cajas, el posicionamiento de elementos y la creación de diseños responsivos para diferentes dispositivos."
            },
            {
                "name": "Clase 4: Diseño de formularios en HTML",
                "description": "En esta clase se presentará cómo crear formularios en HTML y cómo se utilizan para recopilar información de los usuarios. También se discutirán los diferentes tipos de elementos de formulario y cómo darles estilo con CSS."
            },
            {
                "name": "Clase 5: Diseño de tablas en HTML",
                "description": "En esta clase se enseñará cómo crear tablas en HTML y cómo se utilizan para mostrar datos de manera organizada. También se discutirán las diferentes etiquetas de tabla y cómo darles estilo con CSS."
            },
            {
                "name": "Clase 6: Publicación y mantenimiento de sitios web",
                "description": "En esta clase se explicará cómo publicar un sitio web en un servidor web y cómo mantenerlo actualizado. Se discutirán las diferentes opciones de alojamiento web, así como las herramientas y técnicas para actualizar y mantener un sitio web."
            }
        ],
        "price": 54545,
        "startDate": "2023-07-01",
        "endDate": "2023-08-01"
    },
    {
        "id": 3,
        "name": "Introduccion a C++",
        "capacity": 40,
        "teachers": [57,58,59],
        "students": [21,22,23,24,25,26,27,28,29,30, 1],
        "classes": [
            {
                "name": "Clase 1: Introducción a C++",
                "description": "En esta clase se presentará el lenguaje de programación C++, su historia, características y beneficios. También se mostrará cómo instalar C++ y configurar el entorno de trabajo."
            },
            {
                "name": "Clase 2: Variables y tipos de datos",
                "description": " En esta clase se enseñará cómo crear y manipular variables en C++, y se presentarán los diferentes tipos de datos básicos como enteros, flotantes, caracteres y booleanos."
            },
            {
                "name": "Clase 3: Estructuras de control de flujo",
                "description": "En esta clase se explicará cómo controlar el flujo de ejecución de un programa en C++ utilizando estructuras como if-else, while, for y switch."
            },
            {
                "name": "Clase 4: Funciones",
                "description": "En esta clase se presentarán las funciones en C++, cómo crearlas, llamarlas y pasar argumentos a ellas. También se discutirá sobre la importancia de las funciones y cómo se utilizan en la programación."
            },
            {
                "name": "Clase 5: Arreglos y punteros",
                "description": "En esta clase se enseñará cómo utilizar arreglos y punteros en C++ para almacenar y manipular datos. También se discutirán las operaciones básicas en estas estructuras de datos y se darán ejemplos de su uso en programas simples."
            },
            {
                "name": "Clase 6: Programación orientada a objetos",
                "description": "En esta clase se presentará la programación orientada a objetos en C++, incluyendo la creación de clases y objetos, herencia, polimorfismo y encapsulamiento. También se discutirán las buenas prácticas para la programación orientada a objetos y cómo se utiliza en proyectos reales."
            }
        ],
        "price": 74866,
        "startDate": "2023-09-01",
        "endDate": "2023-10-01"
    },
    {
        "id": 4,
        "name": "Inteligencia Artificial",
        "capacity": 40,
        "teachers": [60,61,62],
        "students": [31,32,33,34,35,36,37,38,39,40,1],
        "classes": [
            {
                "name": "Clase 1: Introducción a la Inteligencia Artificial",
                "description": "En esta clase se presentará una introducción general a la Inteligencia Artificial, sus aplicaciones y los diferentes enfoques que se utilizan para desarrollarla."
            },
            {
                "name": "Clase 2: Aprendizaje automático",
                "description": "En esta clase se discutirán los fundamentos del aprendizaje automático, incluyendo los algoritmos de clasificación, regresión, agrupamiento y aprendizaje por refuerzo."
            },
            {
                "name": "Clase 3: Redes neuronales artificiales",
                "description": "En esta clase se explicará cómo funcionan las redes neuronales artificiales, cómo se entrenan y cómo se utilizan para resolver problemas de aprendizaje profundo."
            },
            {
                "name": "Clase 4: Procesamiento del lenguaje natural",
                "description": "En esta clase se presentarán los fundamentos del procesamiento del lenguaje natural, incluyendo la comprensión del lenguaje natural, la generación de lenguaje natural y las aplicaciones prácticas como la traducción automática y la generación de texto."
            },
            {
                "name": "Clase 5: Visión por computadora",
                "description": "En esta clase se presentará cómo las computadoras pueden interpretar imágenes y videos, incluyendo la detección de objetos, el seguimiento de objetos y la segmentación de imágenes."
            },
            {
                "name": "Clase 6: Ética y consideraciones sociales en la Inteligencia Artificial",
                "description": "En esta clase se discutirán las preocupaciones éticas y sociales relacionadas con el desarrollo y uso de la Inteligencia Artificial, incluyendo temas como la privacidad, la responsabilidad y la equidad."
            }
        ],
        "price": 24123,
        "startDate": "2023-09-01",
        "endDate": "2023-10-01"
    },
    {
        "id": 5,
        "name": "Robotica",
        "capacity": 40,
        "teachers": [63,64,65],
        "students": [41,42,43,44,45,46,47,48,49,50],
        "classes": [
            {
                "name": "Clase 1: Introducción a la robótica",
                "description": "En esta clase se presentará una introducción general a la robótica, sus aplicaciones y los diferentes tipos de robots que existen."
            },
            {
                "name": "Clase 2: Diseño y construcción de robots",
                "description": " En esta clase se enseñará cómo diseñar y construir robots desde cero, incluyendo la selección de materiales, la elección de componentes y la integración de hardware y software."
            },
            {
                "name": "Clase 3: Control y programación de robots",
                "description": "En esta clase se discutirán los fundamentos del control y la programación de robots, incluyendo la programación de microcontroladores, la programación de robots con ROS (Robot Operating System) y la integración de sensores y actuadores."
            },
            {
                "name": "Clase 4: Visión y percepción en robots",
                "description": "En esta clase se presentarán los fundamentos de la visión y la percepción en robots, incluyendo la detección de objetos, el seguimiento de objetos y la navegación autónoma."
            },
            {
                "name": "Clase 5: Robótica colaborativa y aplicaciones prácticas",
                "description": "En esta clase se discutirán las aplicaciones prácticas de la robótica, incluyendo la robótica colaborativa y el uso de robots en la industria, la salud y la educación."
            },
            {
                "name": "Clase 6: Ética y consideraciones sociales en la robótica",
                "description": "En esta clase se discutirán las preocupaciones éticas y sociales relacionadas con el desarrollo y uso de robots, incluyendo temas como la privacidad, la responsabilidad y la equidad."
            }
        ],
        "price": 74124,
        "startDate": "2023-09-01",
        "endDate": "2023-10-01"
    }
]
